import { Helmet } from 'react-helmet';
import styles from './index.css';

export default function() {
  return (
    <div className={styles.home}>
      <Helmet>
        <meta charSet="utf-8" />
        <title>首页</title>
      </Helmet>
      “生活，痛并快乐着。”白岩松如是说。而我们总是期待生活着的每一天都是快乐幸福的。
      然而纵观古今，没有幸福的人是不痛苦的，也没有痛苦的人是不快乐的。
      李白，放浪形骸之外的谪仙人，访天姥寻白鹿的诗仙，他饮尽好酒，作遍豪诗，他不幸福吗？他游山玩水，出入自由，他不快乐吗？但同样，他是痛苦的，唐朝为何宜诗宜酒不宜人？纵使其满腹才华却也只能当一个毫无实用的御用文人？难道他不痛苦吗？因为痛苦，才明白快乐的可贵，若是没有那些痛苦，李白又怎会吟出如此壮诗来？又如何去幸福呢？
      海伦。凯勒，双耳失聪，听不到泉水丁冬，听不到鸟语啾啾，听不到父母最温暖的呼唤，她不痛苦；她双眼失明，看不到红艳艳的太阳，看不到青山绿水的米人美景，看不到父母亲人的脸庞，她不痛苦吗？不，她非常痛苦！可是她何尝不快乐，她认识了莎利老师，她学会了说话、写字，她能够读完牛津大学，她甚至还写了自传！她的《假如给我三天光明》都深深打动了我们。她的名字和事迹鼓舞了千千万万残疾韧！她不幸福吗？不，她很幸福。她不仅拯救了自己，也拯救了他人。她实现了自我价值，也让更多人有信心去实现自我价值！
      原来，我曾苦苦寻觅的幸福生活不过是无数绚丽的色彩泡泡，一触即破。幸福与痛苦是相生的，因为只有痛苦过了才知道幸福，幸福只是相对而言。或许说，所有的痛苦都是幸福，因为痛苦的过程本身就是美的，也只有痛苦过的人才能创造幸福！
      于是，在后来的日子里，我不会再害怕，不害怕铺天盖地来的试卷，不害怕高考的重压，不害怕未来的崎岖道路，因为痛苦快乐着，才是人生的道路；痛苦快乐着才是生活的滋味；因为痛苦快乐着才是人生的真谛。
      让我痛苦吧，我将创造幸福！ 让我幸福吧，我会创造生活！ 让我痛并快乐的生活着
    </div>
  );
}
